config.org
#+TITLE: XYU的Doom Emacs 配置
* Table of Content :toc:
- [[#系统设置][系统设置]]
- [[#个人信息][个人信息]]
  - [[#用于加密等][用于加密等]]
- [[#ui-配置][UI 配置]]
  - [[#设置-doom-theme行号等][设置 doom theme、行号等]]
  - [[#dashboard-配置][Dashboard 配置]]
  - [[#启动窗口大小][启动窗口大小]]
  - [[#doom-modeline-配置][doom-modeline 配置]]
- [[#通用配置][通用配置]]
  - [[#常用的全局键绑定][常用的全局键绑定]]
  - [[#默认设置自动保存等][默认设置（自动保存等）]]
  - [[#evil-模式下在窗口间快速移动][Evil 模式下在窗口间快速移动]]
  - [[#增加几个-bookmark-命令][增加几个 Bookmark 命令]]
- [[#org-mode-配置][Org-mode 配置]]
  - [[#org-默认目录][Org 默认目录]]
  - [[#美化-org][美化 Org]]
  - [[#设置-todo-的默认配置][设置 TODO 的默认配置]]
  - [[#设置-org-agenda][设置 Org-agenda]]
  - [[#org-capture-模板配置][Org-capture 模板配置]]
  - [[#org-modern][org-modern]]
  - [[#org-appear][org-appear]]
  - [[#org-download][org-download]]
  - [[#org-to-docx][org to docx]]
- [[#org-roam-配置][Org-roam 配置]]
- [[#补全company配置][补全（Company）配置]]
- [[#dired-配置][DIRED 配置]]
- [[#其他功能配置][其他功能配置]]

* 系统设置
#+begin_src emacs-lisp
;;; config.el -*- lexical-binding: t; -*-
#+end_src
* 个人信息
** 用于加密等
#+begin_src emacs-lisp
(setq user-full-name "Jason Chao"
      user-mail-address "jason@chao.com")
#+end_src
* UI 配置
** 设置 doom theme、行号等
#+begin_src emacs-lisp
;;(setq doom-theme 'doom-vibrant)
;;(setq doom-theme 'doom-zenburn)
(setq doom-theme 'modus-operandi-tinted) ;;light theme
;;(setq doom-theme 'modus-vivendi-tinted) ;;dark theme
;;(setq doom-theme 'doom-one-light)
(setq display-line-numbers-type t) ;;行号
(global-visual-line-mode 1) ;;换行
;;美化buffer name
(setq doom-fallback-buffer-name "► Doom"
      +doom-dashboard-name "► Doom")
;;字体
;;(set-face-attribute 'default nil :height 160)
;;西文字体
(setq doom-font (font-spec :family "Source Code Pro" :size 15)
      doom-big-font (font-spec :family "Source Code Pro" :size 30)
      doom-variable-pitch-font (font-spec :family "Source Code Variable" :size 15)
      doom-unicode-font (font-spec :family "JuliaMono")
      doom-serif-font (font-spec :family "TeX Gyre Cursor")
      )
;;中文字体
;;(defun xyu/doom-init-ui-misc()
;;  (menu-bar-mode -1)               ;; disable menu-bar
;; (setq-default cursor-type 'box)  ;; set box style cursor
;;  (blink-cursor-mode -1)           ;; cursor not blink
 ;; <<doom-dashboard-layout>>
;;  (if (display-graphic-p)
;;      (progn
        ;; NOTE: ONLY GUI
        ;; set font
;;        (dolist (charset '(kana han symbol cjk-misc bopomofo gb18030))
;;          (set-fontset-font (frame-parameter nil 'font) charset
;;                            (font-spec :family "Source Han Mono")))
;;        (appendq! face-font-rescale-alist
;;                  '(("Source Han Mono" . 1.2)
;;                    ))
  ;;      <<doom-image-banner>>
        ;; random banner image from bing.com, NOTE: https://emacs-china.org/t/topic/264/33
;;        )
;;    (progn
      ;; NOTE: ONLY TUI
   ;;   <<doom-ascii-banner>>
;;      )))
;;(add-hook! 'doom-init-ui-hook #'xyu/doom-init-ui-misc)
#+end_src
** Dashboard 配置
** 启动窗口大小
#+begin_src emacs-lisp
(pushnew! initial-frame-alist '(width . 140) '(height . 220))
;;(add-hook! 'window-setup-hook #'toggle-frame-fullscreen)
#+end_src
** doom-modeline 配置
#+begin_src emacs-lisp
;;默认修改中的文件名颜色是红色，这里改为orange
(custom-set-faces!
  '(doom-modeline-buffer-modified :foreground "orange"))
;;将modeline的高度从默认的25改为45
(setq doom-modeline-height 45)
;; 当文件不是utf编码时才显示提示，否则隐藏
(defun doom-modeline-conditional-buffer-encoding ()
  "We expect the encoding to be LF UTF-8, so only show the modeline when this is not the case"
  (setq-local doom-modeline-buffer-encoding
              (unless (and (memq (plist-get (coding-system-plist buffer-file-coding-system) :category)
                                 '(coding-category-undecided coding-category-utf-8))
                           (not (memq (coding-system-eol-type buffer-file-coding-system) '(1 2))))
                t)))

(add-hook 'after-change-major-mode-hook #'doom-modeline-conditional-buffer-encoding)
;;设置modeline中展示的内容
(after! doom-modeline
  (custom-set-variables '(doom-modeline-buffer-file-name-style 'relative-to-project)
                        '(doom-modeline-major-mode-icon t)
                        '(doom-modeline-modal-icon nil))
  (nyan-mode t)) ;;彩虹猫
;; open dashboard
;;(map! :leader :desc "Dashboard" "d" #'+doom-dashboard/open)
#+end_src
* 通用配置
** 常用的全局键绑定
#+begin_src emacs-lisp
;;复制粘贴等，保持与系统习惯一致
(global-set-key (kbd "s-a") 'mark-whole-buffer) ;;对应Windows上面的Ctrl-a 全选
(global-set-key (kbd "s-c") 'kill-ring-save) ;;对应Windows上面的Ctrl-c 复制
(global-set-key (kbd "s-s") 'save-buffer) ;; 对应Windows上面的Ctrl-s 保存
(global-set-key (kbd "s-v") 'yank) ;对应Windows上面的Ctrl-v 粘贴
(global-set-key (kbd "s-z") 'undo) ;对应Windows上面的Ctrol-z 撤销
(global-set-key (kbd "s-x") 'kill-region) ;对应Windows上面的Ctrol-x 剪切
;;调用常用的命令或函数
(global-set-key (kbd "C-s") 'consult-line) ;;同“SPC s s”，类似于swiper的搜索方式
(global-set-key (kbd "<f12>") 'org-roam-capture) ;;打开org-roam捕捉模板
(global-set-key (kbd "<f7>") 'org-tags-view) ;;按tag筛选内容
#+end_src

** 默认设置（自动保存等）
#+begin_src emacs-lisp
(setq-default
 delete-by-moving-to-trash t        ; 将文件删除到回收站
 window-combination-resize t        ; 从其他窗口获取新窗口的大小
 x-stretch-cursor t                 ; 将光标拉伸到字形宽度
 )

(setq! undo-limit 104857600         ; 重置撤销限制到 100 MiB
       ;;auto-save-default t          ; 没有人喜欢丢失工作，我也是如此
       truncate-string-ellipsis "…" ; Unicode 省略号相比 ascii 更好
                                    ; 同时节省 /宝贵的/ 空间
       password-cache-expiry nil    ; 我能信任我的电脑 ... 或不能?
       ; scroll-preserve-screen-position 'always
                                    ; 不要让 `点' (光标) 跳来跳去
       scroll-margin 2              ; 适当保持一点点边距
       gc-cons-threshold 1073741824
       read-process-output-max 1048576
       )
(setq auto-save-visited-mode t)
(auto-save-visited-mode +1)
(setq auto-revert-use-notify nil)
#+end_src
** Evil 模式下在窗口间快速移动
#+begin_src emacs-lisp
(map! :map evil-window-map
      "SPC" #'rotate-layout
      ;; 方向
      "<left>"   #'evil-window-left
      "<down>"   #'evil-window-down
      "<up>"     #'evil-window-up
      "<right>"  #'evil-window-right
      ;; 交换窗口
      "C-<left>"   #'+evil/window-move-left
      "C-<down>"   #'+evil/window-move-down
      "C-<up>"     #'+evil/window-move-up
      "C-<right>"  #'+evil/window-move-right
      )
#+end_src
** 增加几个 Bookmark 命令
- SPC b m：设置 bookmark
- SPC b L：列出 bookmark
- SPC b w：保存 bookmark 到一个文件中
#+begin_src emacs-lisp
(map! :leader
      (:prefix ("b". "buffer")
       :desc "List bookmarks" "L" #'list-bookmarks
       :desc "Save current bookmarks to bookmark file" "w" #'bookmark-save))
#+end_src
* Org-mode 配置
** Org 默认目录
#+begin_src emacs-lisp
(after! org (setq org-directory "~/Dropbox/Org-Notes/"))
#+end_src
** 美化 Org
#+begin_src emacs-lisp
(after! org (add-hook 'org-mode-hook
          (lambda ()
            (variable-pitch-mode 1)
            visual-line-mode))
;;
(setq org-hide-emphasis-markers t
      org-fontify-done-headline t
      org-odd-levels-only t
      ;;org-hide-leading-stars t
      org-log-done 'time
      org-pretty-entities t))
;;更改层级列表的样式
(after! org (setq org-list-demote-modify-bullet '(("+" . "-") ("-" . "+") ("*" . "+") ("1." . "a."))))
#+end_src
** 设置 TODO 的默认配置
(t)代表快捷字母；!代表时间戳；@代表一个有时间戳的记录笔记
#+begin_src emacs-lisp
(after! org (setq org-todo-keywords
      '((sequence "TODO(t)" "IN-PROGRESS(i)" "WAITING(w)" "DELEGATED(e!)" "|" "DONE(d@/!)" "CANCELED(c@/!)"))))
#+end_src
** 设置 Org-agenda
*** 配置可检索的 Agenda 文件
#+begin_src emacs-lisp
(after! org (setq org-agenda-files
      (quote ("~/Dropbox/Org-Notes/" "~/Dropbox/Org-Notes/GTD/" "~/Dropbox/Org-Notes/Roam/projects/"))))
;;设置默认的视图模式，doom默认为week视图，此配置暂时屏蔽
;;(setq org-agenda-span 'week)
;;(setq org-agenda-span 'day)
#+end_src
*** 学习 网上设置，设置新的 agenda 网格，以 3 小时为一单元
#+begin_src emacs-lisp
(after! org (setq org-agenda-time-grid (quote ((daily today require-timed)
                                   (300
                                    600
                                    900
                                    1200
                                    1500
                                    1800
                                    2100
                                    2400)
                                   "......"
                                   "-----------------------------------------------------"
                                   ))))
#+end_src
