config.org
*** 日记配置
#+begin_src emacs-lisp
;;设置location，以便计算日出日落时间
(setq calendar-longitude 116.9962)
(setq calendar-latitude 39.91)
;;计算sunrise和sunset的时间
(defun diary-sunrise ()
  (let ((dss (diary-sunrise-sunset)))
    (with-temp-buffer
      (insert dss)
      (goto-char (point-min))
      (while (re-search-forward " ([^)]*)" nil t)
        (replace-match "" nil nil))
      (goto-char (point-min))
      (search-forward ",")
      (buffer-substring (point-min) (match-beginning 0)))))

(defun diary-sunset ()
  (let ((dss (diary-sunrise-sunset))
        start end)
    (with-temp-buffer
      (insert dss)
      (goto-char (point-min))
      (while (re-search-forward " ([^)]*)" nil t)
        (replace-match "" nil nil))
      (goto-char (point-min))
      (search-forward ", ")
      (setq start (match-end 0))
      (search-forward " at")
      (setq end (match-beginning 0))
      (goto-char start)
      (capitalize-word 1)
      (buffer-substring start end))))
;;diary文件位置
(after! org (setq org-agenda-include-diary t))
(after! org (setq org-agenda-diary-file "~/Dropbox/Org-Notes/personal/mydiary"))
(after! org (setq diary-file "~/Dropbox/Org-Notes/personal/mydiary"))
#+end_src
*** 习惯配置
#+begin_src emacs-lisp
(after! org (add-to-list 'org-modules 'org-habit t))
(after! org (setq org-habit-graph-column t))
#+end_src
*** newday 函数，用于在 everyday.org 中插入日结构
#+begin_src emacs-lisp
(defun newday ()
  (interactive)
  (progn
    (find-file "~/Dropbox/Org-Notes/everyday.org")
    (goto-char (point-max))
    (insert "*" ?\s (format-time-string "%Y-%m-%d %A") ?\n
            "** PLAN\n"
            "** WORKLOG\n"
            "** LIFELOG\n"
            "** EVENTS\n"
            "** REVIEW\n"
            "*** 今天最大的成果什么？ \n"
            "*** 今天有什么惊喜？ \n"
            "*** 今天有什么需要改进的地方？ \n"
            )))
#+end_src
** Org-capture 模板配置
#+begin_src emacs-lisp
;;自定义函数，用于定位everyday.org中的几个关键heading的位置
(defun my-org-goto-last-worklog-headline ()
  "Move point to the last headline in file matching \"* WORKLOG\"."
  (end-of-buffer)
  (re-search-backward "\\* WORKLOG"))

(defun my-org-goto-last-event-headline ()
  "Move point to the last headline in file matching \"* EVENTS\"."
  (end-of-buffer)
  (re-search-backward "\\* EVENTS"))

(defun my-org-goto-last-lifelog-headline ()
  "Move point to the last headline in file matching \"* LIFELOG\"."
  (end-of-buffer)
  (re-search-backward "\\* LIFELOG"))

;; org-capture模板
(after! org (setq org-capture-templates
      '(("t" "TASK" entry (file+headline "GTD/task.org" "Tasks")
         "* TODO %i%? [/] :@work: \n %U\n")
        ;;("p" "PROJECT" entry (file "GTD/project.org")
        ;; "* STARTUP %i%? [%] :PROJECT:@work: \n created on %U\n")
        ("c" "CAPTURE" entry (file "capture.org")
         "* %^{Title} :IDEA:%^{Tags}: \n created on %T\n From: %a\n")
        ("m" "MEETING" entry (file+headline "GTD/meeting.org" "Meetings")
         "* TODO %i%? :MEETING:@work: \n created on %U\n")
        ("w" "WORKLOG" entry
         (file+function "everyday.org"
                        my-org-goto-last-worklog-headline)
         "* %^{Title} :@work:%^{Tags}: \n%T")
        ("l" "LIFELOG" entry
         (file+function "everyday.org"
                        my-org-goto-last-lifelog-headline)
         "* %^{Title} :@life:%^{Tags}: \n%T")
        ("e" "EVENT" entry
         (file+function "everyday.org"
                        my-org-goto-last-event-headline)
         "* %^{Title} \n%T"))))

#+end_src
** org-modern
- 说明：一个美化效果包
- 安装：package.el中增加org-modern
#+begin_src emacs-lisp
(use-package! org-modern
  :hook (org-mode . org-modern-mode)
  :config
    (setq org-modern-list '((?+ . "➤")
                               (?- . "–")
                               (?* . "•"))
             org-modern-star '("Ⓐ" "Ⓑ" "Ⓒ" "Ⓓ" "Ⓔ" "Ⓕ" "Ⓖ" "Ⓗ" "Ⓘ" "Ⓙ" "Ⓚ" "Ⓛ" "Ⓜ")
             org-modern-table nil
             org-modern-tag nil)
    ;;(:hook-into org-mode)
    ;; (add-hook 'org-agenda-finalize-hook #'org-modern-agenda)
    )
#+end_src
** org-appear
- 说明：自动切换被隐藏的一些org元素，比如link等
#+begin_src emacs-lisp
(use-package! org-appear
  :after org
  :config
  (setq org-appear-autolinks t)
  (setq org-appear-trigger 'manual)
  (add-hook 'org-mode-hook (lambda ()
                           (add-hook 'evil-insert-state-entry-hook
                                     #'org-appear-manual-start
                                     nil
                                     t)
                           (add-hook 'evil-insert-state-exit-hook
                                     #'org-appear-manual-stop
                                     nil
                                     t)))
  ;; (setq org-link-descriptive nil)

  (add-hook 'org-mode-hook 'org-appear-mode))
#+end_src
** org-download
- 说明：使用拖拽方式在org文件中添加图片
- 安装：doom emacs org-mode 内置模块
#+begin_src emacs-lisp
(after! org-download
  (add-hook 'org-mode-hook 'org-download-enable)
  (setq org-download-image-dir ("~/Dropbox/Org-Notes/images"))
  (setq org-download-screenshot-method 'screencapture)
  (setq org-download-abbreviate-filename-function 'expand-file-name)
  (setq org-download-timestamp "%Y%m%d%H%M%S")
  (setq org-download-display-inline-images nil)
  (setq org-download-heading-lvl nil)
  (setq org-download-annotate-function (lambda (_link) ""))
  (setq org-download-image-attr-list '("#+NAME: fig: "
                                       "#+CAPTION: "
                                       "#+ATTR_ORG: :width 500px"
                                       "#+ATTR_LATEX: :width 10cm :placement [!htpb]"
                                       "#+ATTR_HTML: :width 600px"))
  ;; (setq org-download-screenshot-basename ".png")
  )
#+end_src
** org to docx
- 说明：使用pandoc将org文件转换为docx
#+begin_src emacs-lisp
(defun org-export-docx ()
    "Convert org to docx."
    (interactive)
    (let ((docx-file (concat (file-name-sans-extension (buffer-file-name)) ".docx"))
          (template-file ("~/.doom.d/template/template.docx")))
      (shell-command (format "pandoc %s -o %s --reference-doc=%s" (buffer-file-name) docx-file template-file))
      (message "Convert finish: %s" docx-file)))
#+end_src
* Org-roam 配置
- 说明：基于 org-mode 的双链笔记
*** 简化文件插入链接
#+begin_src emacs-lisp
(defun +org-insert-file-link ()
  "Insert a file link.  At the prompt, enter the filename."
  (interactive)
  (insert (format "[[%s]]" (org-link-complete-file))))
;;
(map! :after org
      :map org-mode-map
      :localleader
      "l f" #'+org-insert-file-link)
#+end_src
- 说明：用Emacs实现文献（电子书等）阅读、笔记流程
- 安装：
  + 主要参考了Jousimies的bibtex配置
- 配置:主要使用了citar这个包
- 使用：
  + 直接搜索citekey并打开pdf文件：M-x citar-open-files
  + 创建文献笔记：M-x citar-create-note
  + 打开文献笔记：M-x citar-open-note
  + 打开/创建文献笔记：M-x citar-open-notes
  + 打开note对应的pdf文件：M-x orb-note-actions
  + 检索文献笔记：M-x org-roam-rf-find
* 补全（Company）配置
来自:completion company,一套补全框架(vertico,orderless,marginalia,embark,consult)
#+begin_src emacs-lisp
(after! company
  (setq company-idle-delay 0.5
        company-minimum-prefix-length 2)
  (setq company-show-numbers t)
  (add-hook 'evil-normal-state-entry-hook #'company-abort)) ;; make aborting less annoying.
;;增强history
(setq-default history-length 1000)
(setq-default prescient-history-length 1000)
#+end_src
