config.org
*** Beancount
- 说明：一个纯文本记账应用
- 安装：init.el中去除beancount模块的注释
#+begin_src emacs-lisp
;;from: https://github.com/tecosaur/emacs-config/blob/master/config.org
(use-package! beancount
  :mode ("\\.beancount\\'" . beancount-mode)
  :init
  (after! all-the-icons
    (add-to-list 'all-the-icons-icon-alist
                 '("\\.beancount\\'" all-the-icons-material "attach_money" :face all-the-icons-lblue))
    (add-to-list 'all-the-icons-mode-icon-alist
                 '(beancount-mode all-the-icons-material "attach_money" :face all-the-icons-lblue)))
  :config
  (setq beancount-electric-currency t)
  (defun beancount-bal ()
    "Run bean-report bal."
    (interactive)
    (let ((compilation-read-command nil))
      (beancount--run "bean-report"
                      (file-relative-name buffer-file-name) "bal")))
  (map! :map beancount-mode-map
        :n "TAB" #'beancount-align-to-previous-number
        :i "RET" (cmd! (newline-and-indent) (beancount-align-to-previous-number))))
#+end_src
*** keyfreq
- 说明：一个记录按键频次的小包
- 安装：package.el中增加
#+begin_src elisp
  (use-package! keyfreq
    :config
     (keyfreq-mode 1)
     (keyfreq-autosave-mode 1))
#+end_src
*** Org-mode中tag自动补全
- 来自：https://emacs-china.org/t/org-mode-headline/17584
#+begin_src elisp
(setq org-use-fast-tag-selection t)
(defun eh-org-fast-tag-selection (&rest args)
  (let* ((current-tags (cl-copy-list (car args)))
         (n (length current-tags))
         (max 5)
         (prompt (if (> n 0)
                     (format "Tag (%s%s): "
                             (mapconcat #'identity
                                        (cl-subseq current-tags 0 (min n max))
                                        ", ")
                             (if (> n max)
                                 " ..."
                               ""))
                   "Tag: "))
         (crm-separator"[ 	]*[:,][ 	]*")
         (tgs (completing-read-multiple
               prompt (mapcar
                       (lambda (x)
                         (if (member (car x) current-tags)
                             (cons (propertize (car x) 'face '(:box t)) (cdr x))
                           x))
                       (org-get-buffer-tags)))))
    (dolist (tg (delete-dups (remove "" tgs)))
      (when (string-match "\\S-" tg)
        (if (member tg current-tags)
	    (setq current-tags (delete tg current-tags))
	  (push tg current-tags))))
    (org-make-tag-string current-tags)))
(advice-add 'org-fast-tag-selection :override #'eh-org-fast-tag-selection)
#+end_src
*** ChatGPT（mind-wave)配置
说明：来自https://github.com/manateelazycat/mind-wave/blob/master/README.zh-CN.md
#+begin_src emacs-lisp
(add-to-list 'load-path "/Users/qianli/AI/mind-wave")
(require 'mind-wave)
(setq mind-wave-auto-change-title nil) ;;关闭自动生成title的功能
#+end_src
