config.el

;;from: https://github.com/tecosaur/emacs-config/blob/master/config.org
(use-package! beancount
  :mode ("\\.beancount\\'" . beancount-mode)
  :init
  (after! all-the-icons
    (add-to-list 'all-the-icons-icon-alist
                 '("\\.beancount\\'" all-the-icons-material "attach_money" :face all-the-icons-lblue))
    (add-to-list 'all-the-icons-mode-icon-alist
                 '(beancount-mode all-the-icons-material "attach_money" :face all-the-icons-lblue)))
  :config
  (setq beancount-electric-currency t)
  (defun beancount-bal ()
    "Run bean-report bal."
    (interactive)
    (let ((compilation-read-command nil))
      (beancount--run "bean-report"
                      (file-relative-name buffer-file-name) "bal")))
  (map! :map beancount-mode-map
        :n "TAB" #'beancount-align-to-previous-number
        :i "RET" (cmd! (newline-and-indent) (beancount-align-to-previous-number))))

(use-package! keyfreq
  :config
   (keyfreq-mode 1)
   (keyfreq-autosave-mode 1))

(setq org-use-fast-tag-selection t)
(defun eh-org-fast-tag-selection (&rest args)
  (let* ((current-tags (cl-copy-list (car args)))
         (n (length current-tags))
         (max 5)
         (prompt (if (> n 0)
                     (format "Tag (%s%s): "
                             (mapconcat #'identity
                                        (cl-subseq current-tags 0 (min n max))
                                        ", ")
                             (if (> n max)
                                 " ..."
                               ""))
                   "Tag: "))
         (crm-separator"[ 	]*[:,][ 	]*")
         (tgs (completing-read-multiple
               prompt (mapcar
                       (lambda (x)
                         (if (member (car x) current-tags)
                             (cons (propertize (car x) 'face '(:box t)) (cdr x))
                           x))
                       (org-get-buffer-tags)))))
    (dolist (tg (delete-dups (remove "" tgs)))
      (when (string-match "\\S-" tg)
        (if (member tg current-tags)
	    (setq current-tags (delete tg current-tags))
	  (push tg current-tags))))
    (org-make-tag-string current-tags)))
(advice-add 'org-fast-tag-selection :override #'eh-org-fast-tag-selection)

(add-to-list 'load-path "/Users/qianli/AI/mind-wave")
(require 'mind-wave)
(setq mind-wave-auto-change-title nil) ;;关闭自动生成title的功能
